{
  "name": "Christoph Herrmann",
  "portrait": "img/portrait.jpeg",
  "location": "München, Deutschland",
  "job": "Senior Web Developer",
  "company": "maxdome",
  "blockquote": "Ich bin ein Node.js Entwickler, der sich mehr und mehr in Richtung moderne Webanwendungen durch verteilte Services bewegt.",
  "jobinterests": [
    { "title": "Node.js", "description": "Node.js ist für mich derzeit die Sprache mit dem größten Potenzial, der größten Effektivität in der Entwicklung und der zu mir passendsten Kultur. Daher fokusiere ich mich derzeit auch mehr auf Node.js, mache aber zwischendurch auch gerne JavaScript im Frontend." },
    { "title": "Spiele", "description": "Spiele sind nicht nur ein großes Hobby von mir, sondern gehörten auch lange Zeit zu meinem Beruf dazu. Vor allem das Erstellen komplexer Spielmechaniken, die Atmosphäre in der Branche und die Unterhaltung von Spielern machen den Reiz der Spieleentwicklung für mich aus." }
  ],
  "references": {
    "professional": [
      {
        "image": "img/references/professional/maxdome.png",
        "thumbnail": "img/references/professional/thumbnails/maxdome.png",
        "title": "maxdome",
        "description": "Als Mitglied im Frontend Team war ich für das Web Portal, den Blog und auch Clients wie dem Chromecast und dem neuen HTML5 Player verantwortlich. Neben der täglichen Arbeit bin ich vor allem auch technischer Verantwortlicher für die Einführung neuer Technologien wie Node.js und Application Performance Monitoring sowie Pate für größere Features wie dem Pause & Resume.<br/>Als Node.js Entwickler war ich danach Teil des Teams zur Erstellung der Orchestration API um nicht nur Web sondern auch alle anderen Clients für den Relaunch an unser Redaktionssystem anzubinden und die übrigen Backend Services zu abstrahieren.<br/>Aktuell arbeite ich im onboard Projekt am Backend im ICE als auch die dazugehörige API auf maxdome Seite. Vor allem das Handling der Kombination lokaler Daten (Assetdaten und CMS Daten), Backend Anbindungen (Registrierung/Login und Assetbestellung) und Remote Services (Irdeto DRM Lizenzen) sowie das Error Handling, wenn die Verbindung im WiFi oder nach Außen nicht verfügbar ist, sind interessante Herausforderungen.",
        "url": "http://www.maxdome.de"
      },
      {
        "image": "img/references/professional/grimfall.jpg",
        "thumbnail": "img/references/professional/thumbnails/grimfall.jpg",
        "title": "Grimfall",
        "description": "Als technischer Verantwortlicher für das Backend von Grimfall habe ich mich vor allem mit der Architektur des Anwendungsservers, der Datenbank und der API zum Smartphone/Tablet Client beschäftigt. In meiner Freizeit habe ich während der Zeit mein PHP Framework DragonJsonServer entwickelt welches in diesem Projekt Verwendung fand.",
        "url": "http://play.google.com/store/apps/details?id=com.gameforge.strategy"
      },
      {
        "image": "img/references/professional/battleknight.png",
        "thumbnail": "img/references/professional/thumbnails/battleknight.png",
        "title": "BattleKnight",
        "description": "Während der Entwicklung des Redesigns in das vier Mann starke Entwicklerteam dazugestossen. Nach dessen Fertigstellung als alleiniger Entwickler weiterentwickelt und letztendlich als Teamleiter eines kleinen Entwicklungsteams zusammen mit mehreren anderen Spielen betreut war BattleKnight ein langer Begleiter meiner Laufbahn.",
        "url": "http://battleknight.de"
      },
      {
        "image": "img/references/professional/genodata.png",
        "thumbnail": "img/references/professional/thumbnails/genodata.png",
        "title": "GenoData",
        "description": "Den Anfang meiner beruflichen Laufbahn habe ich als Auszubildender bei GenoData bestritten. Vor allem die Nähe zu den Kunden, das hohe Maß an Qualität, Sicherheit und Performance aber vor allem auch die Erfahrungen mit Lua, die mein Herz für Skriptsprachen entflammt haben, haben mich auf meinen weiteren Weg vorbereitet.",
        "url": "http://www.genodata.de"
      }
    ],
    "private": [
      {
        "image": "img/references/private/maxdome-search-command.jpeg",
        "thumbnail": "img/references/private/thumbnails/maxdome-search-command.jpeg",
        "title": "maxdome Search Command",
        "description": "Coming soon...",
        "url": "http://github.com/dragonprojects/mxd-search-command/"
      },
      {
        "image": "img/references/private/maxdome-rssfeeds.png",
        "thumbnail": "img/references/private/thumbnails/maxdome-rssfeeds.png",
        "title": "maxdome RSS-Feeds",
        "description": "Coming soon...",
        "url": "http://maxdome-rssfeeds.herokuapp.com/"
      },
      {
        "image": "img/references/private/dnode.png",
        "thumbnail": "img/references/private/thumbnails/dnode.png",
        "title": "dnode",
        "description": "Coming soon...",
        "url": "http://github.com/dnode/"
      },
      {
        "image": "img/references/private/dragonuniverse.png",
        "thumbnail": "img/references/private/thumbnails/dragonuniverse.png",
        "title": "DragonUniverse",
        "description": "Eine meiner privaten Spielwiesen um neue Möglichkeiten in der Webentwicklung auszuprobieren. Vor allem die Landingpage hat mir viel beigebracht über SEO und Facebooks Open Graph Tags. Aber auch durch das gesamte Projekt entwickle ich mich ständig weiter. Insbesondere das Thema \"Wie entwickelt man eine moderne Webandung\" habe ich mit dem Projekt zum Aufhänger einiger Exkurse und Tech Talks gemacht.",
        "url": "http://dragonuniverse.de"
      },
      {
        "image": "img/references/private/dragonnodejs.png",
        "thumbnail": "img/references/private/thumbnails/dragonnodejs.png",
        "title": "DragonNode.js",
        "description": "Der Kern meiner Pakete die ich für Projekte mit Node.js verwendet habe. Damit habe ich mir privat eine kleine Sammlung an Modulen und Bundles erschaffen um meine privaten Projekte sehr effizient zu entwickeln und habe vor allem viel über modulare Entwicklung und serviceorientierte Architektur (SOA) gelernt.",
        "url": "http://github.com/dragonnodejs"
      },
      {
        "image": "img/references/private/dragonjsonserver.png",
        "thumbnail": "img/references/private/thumbnails/dragonjsonserver.png",
        "title": "DragonJsonServer",
        "description": "Was als kleine Basis für Grimfall für die Kommunikation mit den Clients über eine JsonRPC Schnittstelle begann hat sich schnell zu einem modularen Framework mit umfangreichen Erweiterungen für die Spieleentwicklung entwickelt und lies mich meinen Spieltrieb bei der Entwicklung von Frameworks ausleben.",
        "url": "http://dragonjsonserver.de"
      }
    ]
  },
  "contacts": {
    "email": "sharaal@dragonprojects.de",
    "links": [
      { "image": "img/contacts/xing.png", "title": "Xing", "url": "http://www.xing.com/profile/Christoph_Herrmann34" },
      { "image": "img/contacts/github.png", "title": "GitHub", "url": "http://github.com/dragonprojects" },
      { "image": "img/contacts/blog.png", "title": "Blog", "url": "http://dragonprojects.de" }
    ]
  }
}
